<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.4.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of SonicWall Mobile Connect from the Mac App Store and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.adf78.pkg.SonicWallMobileConnect</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SonicWall Mobile Connect</string>
		<key>PATH</key>
		<string>/Users/giovanni/Desktop/SonicWall Mobile Connect.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.nmcspadden.pkg.appstore</string>
	<key>Process</key>
	<array/>
</dict>
</plist>
