<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.4.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of ServBay.</string>
	<key>Identifier</key>
	<string>com.github.adf78.download.ServBay</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ServBay</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://dl.servbay.com/release/ServBayInstaller-v1.17.0.dmg?_gl=1*bw4v4c*_gcl_au*MTQ5ODA0NTg3NS4xNzYxNTYxMTgz*_ga*MTgxNTc0NTM0My4xNzYxNTYxMTgz*_ga_N9MKY8EBBV*czE3NjE5MjYyMzUkbzgkZzEkdDE3NjE5MjYyMzgkajYwJGwwJGgxMjQ5MTQ2ODA1</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/ServBay.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "Dev.ServBay.macOS.ServBay" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = B5WG79T398)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/ServBay.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
